Revit 2027 API
RebarHostData.GetRebarHostData Method
 Gets a RebarHostData object referring to the specified rebar host element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarHostData GetRebarHostData(
	Element host
)
Public Shared Function GetRebarHostData (
	host As Element
) As RebarHostData
public:
static RebarHostData^ GetRebarHostData(
	Element^ host
)
static member GetRebarHostData :
        host : Element -> RebarHostData
Parameters
host Element
 An element to host rebar.
Return Value
RebarHostData
 A RebarHostData object, or null.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Returns null for elements that cannot ever be rebar hosts, such as levels.
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace